# ── shell & terminal ─────────────────────────────────────────────────────────
brew "fzf"
brew "fd"
brew "bat"
brew "tree"
brew "zoxide"
brew "wget"
brew "jq"
brew "gh"
brew "httpie"
brew "powerlevel10k"

# ── editor ───────────────────────────────────────────────────────────────────
brew "neovim"

# ── secrets ──────────────────────────────────────────────────────────────────
brew "pass"
brew "gnupg"

# ── languages & runtimes ─────────────────────────────────────────────────────
brew "pyenv"
brew "node"
brew "pnpm"
brew "uv"

# ── fonts ─────────────────────────────────────────────────────────────────────
cask "font-hack-nerd-font"
